wcheng95/MiniShell/platform/adv/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Architect-required ADV CPU baseline; independent of the FreeRTOS tick rate.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The resident MiniShell runtime/shell executes on ESP-IDF's main task. Keep
# enough stack for shell/backend call depth; foreground applications run on a
# separate ADV-managed application task and do not borrow this stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Fail clearly on future task-stack exhaustion instead of allowing silent
# memory corruption to turn into an unrelated exception.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# ESP32-S3 defaults to a 32 KiB data cache. The special 16 KiB mode keeps the
# hardware cache configured at 32 KiB but makes another 16 KiB of internal SRAM
# available to the heap. Keep the default 16 KiB instruction cache unchanged.
# This recovered about 15.6 KiB in the Cardputer ADV hardware test.
CONFIG_ESP32S3_DATA_CACHE_16KB=y

# Phase-B RAM squeeze: move only non-ISR hot-path infrastructure from IRAM to
# flash. ESP-IDF documents these as RAM/IRAM-saving options; MiniShell does not
# call heap/ring-buffer APIs from IRAM ISRs. Keep ISR variants in IRAM for now.
# Measure FT8 decode timing before making deeper IRAM reductions.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

# QMX's composite configuration descriptor exceeds IDF's 256-byte default.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# Curiosity-driven UAC robustness experiment: use the component-default
# three URBs with twelve 1 ms packets each.  ESP-IDF's DWC HCD exposes only two
# DMA buffers per pipe, so this should extend the hardware-scheduled horizon
# from about 12 ms (2x6) to about 24 ms (2x12), while reducing UAC RX callback
# frequency further.  The software queue becomes about 36 ms.
CONFIG_UAC_NUM_ISOC_URBS=3
CONFIG_UAC_NUM_PACKETS_PER_URB=12

# Both ADV storage volumes use FATFS: /flash is internal SPI flash through the
# ESP-IDF wear-levelling layer and /sd is removable FATFS over SDSPI. MiniShell's
# Filesystem contract allows names up to MINI_FS_NAME_MAX (255), so enable long
# filenames explicitly. Heap-backed LFN avoids consuming resident/app task
# stack, and UTF-8 keeps VFS filename representation compatible with the
# byte-string MiniShell API.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# ESP-IDF defaults to a separate sector cache in every FATFS FIL object. With
# eight file slots per mounted volume this consumes tens of KiB of resident RAM
# even when no files are open. MiniShell normally has only a few active files
# and ADV-WAV streams a single file, so use FatFs tiny mode/shared sector cache
# instead. This trades some multi-file I/O performance for much lower idle RAM.
# CONFIG_FATFS_PER_FILE_CACHE is not set

# K1 runtime application loading. External applications remain normal ELF APP
# files and resolve MiniShell through explicitly registered MiniShell symbols.
# Do not expose the loader's broad libc/ESP-IDF symbol tables: a portable app
# must reach platform functionality only through the public MiniShell API.
CONFIG_ELF_LOADER=y
# CONFIG_ELF_DYNAMIC_LOAD_SHARED_OBJECT is not set
# CONFIG_ELF_LOADER_LIBC_SYMBOLS is not set
# CONFIG_ELF_LOADER_ESPIDF_SYMBOLS is not set

# ESP-IDF 5.5.1 enables ESP_SYSTEM_MEMPROT_FEATURE by default on ESP32-S3. With
# that feature enabled, the capability allocator intentionally exposes no
# MALLOC_CAP_EXEC heap. The Espressif ELF loader needs executable SRAM for
# relocated .text on this no-PSRAM Cardputer ADV, so runtime ELF loading requires
# memory protection to be disabled. This is an explicit MiniShell ADV platform
# tradeoff.
# CONFIG_ESP_SYSTEM_MEMPROT_FEATURE is not set

# usbmsc temporarily hands the ESP32-S3 USB device peripheral and raw FAT media
# to TinyUSB. Keep the MSC transfer buffer at 4096 bytes so it is large enough
# for the existing /flash wear-levelling sector without changing the validated
# FATFS/wear-levelling storage format.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
